-------------------------------------------------------------------------------
       log:  C:\Documents and Settings\jwang\Desktop\JOLEcluster-runs_table7.lo
> g
  log type:  text
 opened on:  29 May 2008, 16:20:36

. set matsize 450;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory           10M    max. data space                 10.000M
    set matsize         450     max. RHS vars in models          1.583M
                                                            -----------
                                                                13.492M

. use autor-jole-2003.dta;
(EOW SVCs, CPS, rulings research data set)

. * Log total employment - from BLS employment & earnings;
. gen lnemp=ln(annemp);

. * Non-business-service sector employment from CBP;
. gen nonemp= stateemp-svcemp;
(200 missing values generated)

. gen lnnon=ln(nonemp);
(200 missing values generated)

. gen svcfrac= svcemp/nonemp;
(200 missing values generated)

. * Total business services employment from CBP;
. gen bizemp= svcemp+peremp;
(200 missing values generated)

. gen lnbiz = ln(biz);
(200 missing values generated)

. * State dummies, year dummies, and state*time trends;
. gen t=year-78;

. gen t2=t^2;

. drop if state==98;
(0 observations deleted)

. xi i.state i.year i.state*t i.state*t2 i.region*i.year;
i.state           _Istate_11-95       (naturally coded; _Istate_11 omitted)
i.year            _Iyear_74-97        (naturally coded; _Iyear_74 omitted)
i.state*t         _IstaXt_#           (coded as above)
i.state*t2        _IstaXt2_#          (coded as above)
i.region          _Iregion_1-9        (naturally coded; _Iregion_1 omitted)
i.reg~n*i.year    _IregXyea_#_#       (coded as above)

. drop _Iyear_77 - _Iyear_79;

. * Working sample;
. gen year1 = year>=79 & year<=95;

. keep if year1;
(350 observations deleted)

. gen year2 = ((int(year/2)*2 + 1)==year);

. gen year4 = (year==79 | year==83 | year==87 | year==91 | year==95);

. * Generate more aggregate demos;
. gen clp=clg+gtc;

. gen a1624=m1619+m2024+f1619+f2024;

. gen a2554=m2554+f2554;

. gen a55up=m5564+m65up+f5564+f65up;

. gen fem=f1619+f2024+f2554+f5564+f65up;

. gen white=rs_wm+rs_wf;

. gen black=rs_bm+rs_bf;

. gen other=rs_om+rs_of;

. gen married=marfem+marmale;

. * Modify union variable so that:
>   1 - We don't use interpolated data for 1979 & 1981
>   2 - Turn from fraction into percent so that coefficient will be friendly si
> ze;
. replace unmem=. if year==79 | year==81;
(100 real changes made, 100 to missing)

. replace unmem=unmem*100;
(750 real changes made)

. *******************************;
. ** Table 7: leads and lags
> *******************************;
. reg lnths lnemp admico_2 admico_1 admico0 admico1 admico2 admico3 mico4 admpp
> a_2 admppa_1 admppa0 admppa1 admppa2 admppa3 mppa4 admgfa_2 admgfa_1 admgfa0 
> admgfa1 admgfa2 admgfa3 mgfa4 _Iy* _Istate* if year1 , cluster(state);

Linear regression                                      Number of obs =     850
                                                       F( 37,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9732
                                                       Root MSE      =  .29532

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   2.029293   .4338236     4.68   0.000     1.157492    2.901095
    admico_2 |   .0304686   .0664981     0.46   0.649    -.1031644    .1641016
    admico_1 |   .0247429   .0648412     0.38   0.704    -.1055604    .1550462
     admico0 |   .1201128   .0909604     1.32   0.193    -.0626789    .3029045
     admico1 |   .1209861   .1093186     1.11   0.274    -.0986979    .3406701
     admico2 |   .1683294    .130313     1.29   0.203    -.0935444    .4302032
     admico3 |    .083704   .1386334     0.60   0.549    -.1948903    .3622982
       mico4 |   .1000648   .1748302     0.57   0.570    -.2512696    .4513992
    admppa_2 |   .1341538   .0861741     1.56   0.126    -.0390195     .307327
    admppa_1 |   .1138434   .1028856     1.11   0.274     -.092913    .3205998
     admppa0 |   .1371354   .1060163     1.29   0.202    -.0759122     .350183
     admppa1 |   .1938449   .1283265     1.51   0.137    -.0640369    .4517266
     admppa2 |   .1324372   .1429211     0.93   0.359    -.1547735    .4196479
     admppa3 |   .0822747   .1560737     0.53   0.600    -.2313671    .3959166
       mppa4 |   .1090413    .160891     0.68   0.501    -.2142812    .4323639
    admgfa_2 |   .0144155   .1143416     0.13   0.900    -.2153625    .2441936
    admgfa_1 |   .0328045   .1152396     0.28   0.777    -.1987782    .2643872
     admgfa0 |  -.0085204   .1232579    -0.07   0.945    -.2562164    .2391756
     admgfa1 |  -.0699729   .1315354    -0.53   0.597    -.3343031    .1943574
     admgfa2 |  -.0859414   .1464805    -0.59   0.560     -.380305    .2084222
     admgfa3 |  -.0908932   .1494506    -0.61   0.546    -.3912255     .209439
       mgfa4 |  -.0205015   .2029293    -0.10   0.920    -.4283031    .3873001
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |  -.0237734   .0351406    -0.68   0.502    -.0943911    .0468444
   _Iyear_81 |   -.064258   .0507186    -1.27   0.211    -.1661807    .0376647
   _Iyear_82 |  -.0652628   .0657271    -0.99   0.326    -.1973464    .0668207
   _Iyear_83 |  -.0734977   .0544993    -1.35   0.184    -.1830181    .0360228
   _Iyear_84 |   .2004776   .0695089     2.88   0.006     .0607942    .3401609
   _Iyear_85 |   .3438967   .0856574     4.01   0.000     .1717617    .5160317
   _Iyear_86 |   .4257546   .0984224     4.33   0.000     .2279673    .6235418
   _Iyear_87 |   .4976309   .1105467     4.50   0.000     .2754789    .7197829
   _Iyear_88 |   .7756995   .1247522     6.22   0.000     .5250005    1.026398
   _Iyear_89 |   .8141867   .1377273     5.91   0.000     .5374132     1.09096
   _Iyear_90 |   .8313312   .1551083     5.36   0.000     .5196294    1.143033
   _Iyear_91 |   .8815741   .1627554     5.42   0.000     .5545049    1.208643
   _Iyear_92 |   1.006187   .1672261     6.02   0.000     .6701332     1.34224
   _Iyear_93 |   1.234525   .1672244     7.38   0.000     .8984748    1.570575
   _Iyear_94 |   1.325697    .181414     7.31   0.000     .9611321    1.690262
   _Iyear_95 |   1.383593   .1927295     7.18   0.000     .9962885    1.770897
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   .4646064   .2780949     1.67   0.101    -.0942462    1.023459
  _Istate_13 |   .0427445   .3582899     0.12   0.906     -.677266    .7627551
  _Istate_14 |  -.8907737    .749748    -1.19   0.241    -2.397449    .6159013
  _Istate_15 |   1.101782   .1807758     6.09   0.000     .7384999    1.465065
  _Istate_16 |  -.3711573   .5028421    -0.74   0.464    -1.381656    .6393417
  _Istate_21 |  -1.887247   1.200394    -1.57   0.122     -4.29953    .5250359
  _Istate_22 |  -1.318404   .8556815    -1.54   0.130     -3.03796    .4011524
  _Istate_23 |  -1.818573   1.025086    -1.77   0.082     -3.87856    .2414147
  _Istate_31 |  -1.578714   .9766723    -1.62   0.112     -3.54141    .3839827
  _Istate_32 |   -1.18631   .7028946    -1.69   0.098     -2.59883    .2262096
  _Istate_33 |  -1.643801   1.020646    -1.61   0.114    -3.694866    .4072638
  _Istate_34 |  -1.345779   .8886214    -1.51   0.136     -3.13153     .439973
  _Istate_35 |  -.8920698   .6609925    -1.35   0.183    -2.220384    .4362445
  _Istate_41 |  -.5758397   .6166469    -0.93   0.355    -1.815038    .6633586
  _Istate_42 |  -.9040732   .4062411    -2.23   0.031    -1.720445   -.0877011
  _Istate_43 |   -1.02171   .6627949    -1.54   0.130    -2.353646    .3102263
  _Istate_44 |  -.7721648   .3050033    -2.53   0.015    -1.385092   -.1592376
  _Istate_45 |  -.1357129   .2849317    -0.48   0.636    -.7083047    .4368789
  _Istate_46 |   .0351413   .1897464     0.19   0.854    -.3461684    .4164511
  _Istate_47 |  -.7462901   .3645576    -2.05   0.046    -1.478896   -.0136841
  _Istate_51 |   1.602517   .2719691     5.89   0.000     1.055975     2.14906
  _Istate_52 |  -.8235795   .6214539    -1.33   0.191    -2.072438    .4252788
  _Istate_54 |  -1.220983   .7292675    -1.67   0.100    -2.686501    .2445352
  _Istate_55 |   -.639858   .2352139    -2.72   0.009    -1.112538   -.1671781
  _Istate_56 |     -1.321   .7851786    -1.68   0.099    -2.898876    .2568755
  _Istate_57 |  -.6138303   .4743773    -1.29   0.202    -1.567127    .3394665
  _Istate_58 |  -.8329259   .7490638    -1.11   0.272    -2.338226    .6723743
  _Istate_59 |  -1.036236   .9839225    -1.05   0.297    -3.013503    .9410299
  _Istate_61 |  -.7542525   .4633872    -1.63   0.110    -1.685464    .1769589
  _Istate_62 |  -.9234858   .6257141    -1.48   0.146    -2.180905    .3339337
  _Istate_63 |  -.9847821   .4892755    -2.01   0.050    -1.968018   -.0015462
  _Istate_64 |  -1.180845   .3397008    -3.48   0.001    -1.863499   -.4981907
  _Istate_71 |  -.2984098    .301956    -0.99   0.328     -.905213    .3083935
  _Istate_72 |  -.2861987   .5328489    -0.54   0.594    -1.356999    .7846013
  _Istate_73 |  -.2604066   .3906517    -0.67   0.508    -1.045451    .5246373
  _Istate_74 |  -1.833621   1.141938    -1.61   0.115    -4.128432    .4611905
  _Istate_81 |  -.6939455   .3493582    -1.99   0.053    -1.396007     .008116
  _Istate_82 |  -.1088083   .2095896    -0.52   0.606    -.5299944    .3123778
  _Istate_83 |  -.0149319   .4009096    -0.04   0.970    -.8205899    .7907262
  _Istate_84 |  -.3236742   .4899492    -0.66   0.512    -1.308264    .6609155
  _Istate_85 |  -.0608003   .1440424    -0.42   0.675    -.3502642    .2286637
  _Istate_86 |  -.0557277   .4345667    -0.13   0.898    -.9290222    .8175668
  _Istate_87 |   .1640371   .1853566     0.88   0.380    -.2084508    .5365251
  _Istate_88 |   .1136113   .1582575     0.72   0.476     -.204419    .4316417
  _Istate_91 |  -1.112456   .5978634    -1.86   0.069    -2.313907    .0889957
  _Istate_92 |  -.3995145   .3966703    -1.01   0.319    -1.196653    .3976243
  _Istate_93 |  -2.113087    1.33183    -1.59   0.119    -4.789498    .5633252
  _Istate_94 |   .0824029   .4124541     0.20   0.842    -.7464547    .9112604
  _Istate_95 |   .2132682   .1959165     1.09   0.282    -.1804408    .6069771
       _cons |  -19.74364   5.633619    -3.50   0.001    -31.06483   -8.422464
------------------------------------------------------------------------------

. reg lnths lnemp admico_2 admico_1 admico0 admico1 admico2 admico3 mico4 admpp
> a_2 admppa_1 admppa0 admppa1 admppa2 admppa3 mppa4 admgfa_2 admgfa_1 admgfa0 
> admgfa1 admgfa2 admgfa3 mgfa4 _Iy* _Istate* _IstaXt_* if year1 , cluster(stat
> e);

Linear regression                                      Number of obs =     850
                                                       F( 36,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9889
                                                       Root MSE      =  .19622

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.579583   .4032071     3.92   0.000     .7693079    2.389858
    admico_2 |  -.0165746   .0524962    -0.32   0.754    -.1220697    .0889204
    admico_1 |  -.0013235   .0584521    -0.02   0.982    -.1187874    .1161404
     admico0 |   .1076673   .0799233     1.35   0.184    -.0529446    .2682792
     admico1 |    .146888   .0852338     1.72   0.091    -.0243957    .3181717
     admico2 |   .2280517   .1043211     2.19   0.034     .0184107    .4376928
     admico3 |   .1436414    .107401     1.34   0.187    -.0721889    .3594718
       mico4 |   .1963525    .124691     1.57   0.122    -.0542235    .4469285
    admppa_2 |   .0033158   .0577488     0.06   0.954    -.1127346    .1193663
    admppa_1 |   -.055947   .0622141    -0.90   0.373     -.180971     .069077
     admppa0 |  -.0528044   .0810655    -0.65   0.518    -.2157116    .1101028
     admppa1 |   -.015345   .0890194    -0.17   0.864    -.1942361    .1635461
     admppa2 |  -.0688863   .1098287    -0.63   0.533    -.2895954    .1518228
     admppa3 |  -.1293581   .1260013    -1.03   0.310    -.3825672    .1238509
       mppa4 |  -.1307881    .129087    -1.01   0.316    -.3901981     .128622
    admgfa_2 |   .0432939    .073132     0.59   0.557    -.1036704    .1902582
    admgfa_1 |  -.0506417   .0818356    -0.62   0.539    -.2150965    .1138131
     admgfa0 |  -.0974202   .0897704    -1.09   0.283    -.2778206    .0829802
     admgfa1 |  -.1510218   .0747372    -2.02   0.049    -.3012119   -.0008318
     admgfa2 |  -.1782442   .0927686    -1.92   0.061    -.3646696    .0081812
     admgfa3 |  -.1620822   .0870404    -1.86   0.069    -.3369965    .0128321
       mgfa4 |  -.0467481    .095923    -0.49   0.628    -.2395126    .1460163
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0280206   .0343172     0.82   0.418    -.0409424    .0969836
   _Iyear_81 |    .051178   .0482533     1.06   0.294    -.0457906    .1481466
   _Iyear_82 |   .0984658     .06207     1.59   0.119    -.0262685    .2232001
   _Iyear_83 |   .1635201   .0476968     3.43   0.001     .0676697    .2593705
   _Iyear_84 |   .5138913   .0534098     9.62   0.000     .4065604    .6212222
   _Iyear_85 |   .7203501   .0596471    12.08   0.000     .6004848    .8402155
   _Iyear_86 |   .8565299   .0668135    12.82   0.000     .7222631    .9907966
   _Iyear_87 |   .9782853   .0798697    12.25   0.000     .8177812    1.138789
   _Iyear_88 |   1.315435   .0748961    17.56   0.000     1.164926    1.465944
   _Iyear_89 |   1.406302   .0806488    17.44   0.000     1.244232    1.568372
   _Iyear_90 |   1.474521   .0855485    17.24   0.000     1.302605    1.646437
   _Iyear_91 |   1.560687   .0908185    17.18   0.000     1.378181    1.743194
   _Iyear_92 |    1.73421    .091029    19.05   0.000      1.55128    1.917139
   _Iyear_93 |   2.023112    .096845    20.89   0.000     1.828495     2.21773
   _Iyear_94 |   2.174017   .1099031    19.78   0.000     1.953158    2.394875
   _Iyear_95 |   2.288041   .1229673    18.61   0.000     2.040929    2.535153
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.188734   .2341382     5.08   0.000     .7182152    1.659252
  _Istate_13 |  -.4244162    .287238    -1.48   0.146    -1.001643    .1528103
  _Istate_14 |   1.178937   .8735508     1.35   0.183    -.5765293    2.934403
  _Istate_15 |   1.534556   .1107502    13.86   0.000     1.311995    1.757117
  _Istate_16 |   1.562485   .6214532     2.51   0.015     .3136276    2.811341
  _Istate_21 |   .4834933   1.190393     0.41   0.686    -1.908691    2.875678
  _Istate_22 |   .8312931   .8918762     0.93   0.356    -.9609993    2.623585
  _Istate_23 |   .2779032   1.053031     0.26   0.793    -1.838241    2.394048
  _Istate_31 |   .0143943   .9689464     0.01   0.988    -1.932776    1.961565
  _Istate_32 |   .2684605   .7398523     0.36   0.718    -1.218328    1.755249
  _Istate_33 |    .030898   1.001338     0.03   0.976    -1.981367    2.043163
  _Istate_34 |    .272905   .8859353     0.31   0.759    -1.507449    2.053259
  _Istate_35 |   .8415984   .6785348     1.24   0.221    -.5219684    2.205165
  _Istate_41 |   1.119235   .5935784     1.89   0.065    -.0736055    2.312075
  _Istate_42 |    .277266   .4328722     0.64   0.525    -.5926232    1.147155
  _Istate_43 |   .5044826   .6366261     0.79   0.432    -.7748655    1.783831
  _Istate_44 |  -.6348165   .2156664    -2.94   0.005    -1.068214   -.2014187
  _Istate_45 |   .1647836   .2474912     0.67   0.509    -.3325686    .6621358
  _Istate_46 |   .7201098   .1890463     3.81   0.000     .3402069    1.100013
  _Istate_47 |   -.095479   .3898382    -0.24   0.808    -.8788881    .6879301
  _Istate_51 |   2.338894   .2112997    11.07   0.000     1.914271    2.763517
  _Istate_52 |   .8970672   .6354029     1.41   0.164    -.3798227    2.173957
  _Istate_54 |   .3991921   .6836559     0.58   0.562     -.974666     1.77305
  _Istate_55 |   .3715063   .3002046     1.24   0.222    -.2317775    .9747901
  _Istate_56 |  -.2754613   .7258809    -0.38   0.706    -1.734174    1.183251
  _Istate_57 |   .0373301   .4666567     0.08   0.937    -.9004517    .9751119
  _Istate_58 |   .5002775    .694566     0.72   0.475    -.8955052     1.89606
  _Istate_59 |   .3656279   .8945726     0.41   0.685    -1.432083    2.163339
  _Istate_61 |   .2600002   .4510921     0.58   0.567    -.6465033    1.166504
  _Istate_62 |   .0353433   .5788706     0.06   0.952    -1.127941    1.198627
  _Istate_63 |  -.3444413   .5189355    -0.66   0.510    -1.387281    .6983986
  _Istate_64 |  -1.564251   .2987074    -5.24   0.000    -2.164526   -.9639758
  _Istate_71 |   -.081615   .3087337    -0.26   0.793    -.7020386    .5388087
  _Istate_72 |   1.073291   .5782843     1.86   0.069    -.0888151    2.235397
  _Istate_73 |   .6826176   .4158847     1.64   0.107    -.1531341    1.518369
  _Istate_74 |   .0191655   1.109184     0.02   0.986    -2.209823    2.248154
  _Istate_81 |  -.9942076   .2123893    -4.68   0.000     -1.42102   -.5673953
  _Istate_82 |   .0361383   .1674532     0.22   0.830    -.3003715    .3726482
  _Istate_83 |  -.1093943   .2808894    -0.39   0.699    -.6738626    .4550741
  _Istate_84 |    1.18111   .4701838     2.51   0.015     .2362404     2.12598
  _Istate_85 |   .3855641   .0708497     5.44   0.000     .2431864    .5279418
  _Istate_86 |    1.24568    .382607     3.26   0.002     .4768023    2.014557
  _Istate_87 |   .3652695   .1675105     2.18   0.034     .0286444    .7018945
  _Istate_88 |   .8882473   .1150799     7.72   0.000     .6569856    1.119509
  _Istate_91 |   .2289686   .5164293     0.44   0.659    -.8088349    1.266772
  _Istate_92 |   .5366854   .3850773     1.39   0.170    -.2371565    1.310527
  _Istate_93 |   .5306619   1.332578     0.40   0.692    -2.147255    3.208579
  _Istate_94 |   .3409364     .31409     1.09   0.283    -.2902512    .9721239
  _Istate_95 |   1.363438   .1508262     9.04   0.000     1.060341    1.666534
  _IstaXt_12 |  -.0450537   .0089054    -5.06   0.000    -.0629498   -.0271576
  _IstaXt_13 |   .0381058   .0103901     3.67   0.001      .017226    .0589855
  _IstaXt_14 |  -.1045906   .0118885    -8.80   0.000    -.1284814   -.0806998
  _IstaXt_15 |  -.0438008   .0051725    -8.47   0.000    -.0541953   -.0334063
  _IstaXt_16 |  -.1213045   .0127781    -9.49   0.000     -.146983    -.095626
  _IstaXt_21 |  -.1210888   .0088795   -13.64   0.000    -.1389328   -.1032448
  _IstaXt_22 |  -.1104157   .0096855   -11.40   0.000    -.1298794   -.0909519
  _IstaXt_23 |  -.0798396   .0047697   -16.74   0.000    -.0894247   -.0702546
  _IstaXt_31 |  -.0501186   .0068101    -7.36   0.000    -.0638039   -.0364333
  _IstaXt_32 |   -.049159   .0093641    -5.25   0.000    -.0679769   -.0303411
  _IstaXt_33 |  -.0433899    .004059   -10.69   0.000    -.0515468    -.035233
  _IstaXt_34 |  -.0493026   .0041463   -11.89   0.000    -.0576349   -.0409704
  _IstaXt_35 |  -.0874482   .0081988   -10.67   0.000    -.1039243   -.0709721
  _IstaXt_41 |  -.0967809   .0099186    -9.76   0.000    -.1167131   -.0768488
  _IstaXt_42 |  -.0622303   .0106309    -5.85   0.000    -.0835938   -.0408668
  _IstaXt_43 |  -.0696027    .009588    -7.26   0.000    -.0888705   -.0503349
  _IstaXt_44 |  -.0256152   .0107587    -2.38   0.021    -.0472357   -.0039947
  _IstaXt_45 |  -.0445102   .0101615    -4.38   0.000    -.0649305     -.02409
  _IstaXt_46 |  -.0389858   .0100272    -3.89   0.000    -.0591362   -.0188355
  _IstaXt_47 |   -.005015   .0079132    -0.63   0.529     -.020917    .0108871
  _IstaXt_51 |   -.091192   .0065812   -13.86   0.000    -.1044175   -.0779666
  _IstaXt_52 |  -.0912548   .0081973   -11.13   0.000     -.107728   -.0747816
  _IstaXt_54 |  -.0737788   .0098771    -7.47   0.000    -.0936276   -.0539299
  _IstaXt_55 |  -.0670009   .0121174    -5.53   0.000    -.0913517   -.0426501
  _IstaXt_56 |   .0006405   .0113941     0.06   0.955    -.0222568    .0235378
  _IstaXt_57 |    .005244   .0103584     0.51   0.615     -.015572    .0260599
  _IstaXt_58 |  -.0520584   .0049324   -10.55   0.000    -.0619705   -.0421463
  _IstaXt_59 |  -.0321031   .0070899    -4.53   0.000    -.0463508   -.0178553
  _IstaXt_61 |  -.0354601   .0082953    -4.27   0.000    -.0521302   -.0187901
  _IstaXt_62 |  -.0121854   .0089508    -1.36   0.180    -.0301727     .005802
  _IstaXt_63 |  -.0036153   .0136831    -0.26   0.793    -.0311126     .023882
  _IstaXt_64 |   .0989208   .0109937     9.00   0.000     .0768281    .1210135
  _IstaXt_71 |   .0346579   .0073459     4.72   0.000     .0198957      .04942
  _IstaXt_72 |  -.0808142    .005937   -13.61   0.000    -.0927451   -.0688834
  _IstaXt_73 |  -.0448173   .0108106    -4.15   0.000     -.066542   -.0230925
  _IstaXt_74 |  -.0487638   .0096662    -5.04   0.000    -.0681888   -.0293387
  _IstaXt_81 |   .0450785   .0132546     3.40   0.001     .0184424    .0717145
  _IstaXt_82 |   -.000633   .0084526    -0.07   0.941     -.017619    .0163531
  _IstaXt_83 |  -.0132429   .0138483    -0.96   0.344    -.0410721    .0145862
  _IstaXt_84 |  -.0893319   .0096092    -9.30   0.000    -.1086422   -.0700216
  _IstaXt_85 |  -.0201572   .0080897    -2.49   0.016     -.036414   -.0039004
  _IstaXt_86 |  -.0679931   .0165228    -4.12   0.000    -.1011968   -.0347894
  _IstaXt_87 |   .0120113   .0111431     1.08   0.286    -.0103816    .0344041
  _IstaXt_88 |  -.0548785   .0186281    -2.95   0.005    -.0923131    -.017444
  _IstaXt_91 |  -.0608554   .0109894    -5.54   0.000    -.0829395   -.0387714
  _IstaXt_92 |  -.0338295   .0016328   -20.72   0.000    -.0371107   -.0305484
  _IstaXt_93 |  -.1052579   .0048944   -21.51   0.000    -.1150936   -.0954223
  _IstaXt_94 |  -.0427983   .0139334    -3.07   0.003    -.0707985   -.0147981
  _IstaXt_95 |   -.100459   .0087182   -11.52   0.000    -.1179789    -.082939
       _cons |  -14.41741   5.197019    -2.77   0.008    -24.86121    -3.97361
------------------------------------------------------------------------------

. reg lnths lnemp admico_2 admico_1 admico0 admico1 admico2 admico3 mico4 admpp
> a_2 admppa_1 admppa0 admppa1 admppa2 admppa3 mppa4 admgfa_2 admgfa_1 admgfa0 
> admgfa1 admgfa2 admgfa3 mgfa4 _Iy* _Istate* _IstaXt* if year1 , cluster(state
> );

Linear regression                                      Number of obs =     850
                                                       F( 35,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9907
                                                       Root MSE      =  .18607

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.711417   .6354431     2.69   0.010     .4344466    2.988388
    admico_2 |  -.0146692   .0532879    -0.28   0.784    -.1217552    .0924169
    admico_1 |   .0003621   .0799687     0.00   0.996     -.160341    .1610653
     admico0 |   .1082492   .0958175     1.13   0.264    -.0843034    .3008017
     admico1 |   .1456346   .1152116     1.26   0.212    -.0858918    .3771609
     admico2 |   .2236284   .1344072     1.66   0.103    -.0464731    .4937298
     admico3 |   .1444487   .1350396     1.07   0.290    -.1269234    .4158209
       mico4 |   .2222939   .1529683     1.45   0.153    -.0851074    .5296952
    admppa_2 |   .0193951    .079283     0.24   0.808      -.13993    .1787203
    admppa_1 |  -.0288241   .0922389    -0.31   0.756    -.2141851     .156537
     admppa0 |  -.0257237   .1151911    -0.22   0.824     -.257209    .2057615
     admppa1 |    .007101   .1305019     0.05   0.957    -.2551523    .2693544
     admppa2 |  -.0494613   .1538103    -0.32   0.749    -.3585546     .259632
     admppa3 |  -.1059067   .1746147    -0.61   0.547    -.4568082    .2449948
       mppa4 |  -.0900126   .1808451    -0.50   0.621    -.4534345    .2734093
    admgfa_2 |   .0338269   .0654555     0.52   0.608    -.0977108    .1653646
    admgfa_1 |  -.0674008   .1001909    -0.67   0.504    -.2687419    .1339404
     admgfa0 |  -.1240698   .1055708    -1.18   0.246    -.3362222    .0880827
     admgfa1 |  -.1835539   .1319299    -1.39   0.170     -.448677    .0815692
     admgfa2 |  -.2225986   .1523894    -1.46   0.150    -.5288366    .0836394
     admgfa3 |  -.2118363   .1579345    -1.34   0.186    -.5292176    .1055449
       mgfa4 |  -.1167317   .1510402    -0.77   0.443    -.4202584     .186795
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |   .0286864   .0458483     0.63   0.534    -.0634492     .120822
   _Iyear_81 |   .0517114   .0616133     0.84   0.405    -.0721051    .1755279
   _Iyear_82 |   .1023723   .0576678     1.78   0.082    -.0135155    .2182602
   _Iyear_83 |   .1655954   .0716142     2.31   0.025     .0216813    .3095094
   _Iyear_84 |   .5082064   .0947366     5.36   0.000     .3178261    .6985867
   _Iyear_85 |   .7123045   .1163415     6.12   0.000     .4785075    .9461016
   _Iyear_86 |    .846994    .133906     6.33   0.000     .5778997    1.116088
   _Iyear_87 |   .9623743   .1600204     6.01   0.000     .6408013    1.283947
   _Iyear_88 |   1.293017   .1632391     7.92   0.000     .9649758    1.621058
   _Iyear_89 |   1.376481   .1732316     7.95   0.000     1.028359    1.724603
   _Iyear_90 |   1.440775   .1838105     7.84   0.000     1.071394    1.810156
   _Iyear_91 |   1.526591   .1871075     8.16   0.000     1.150585    1.902598
   _Iyear_92 |   1.696265   .1815641     9.34   0.000     1.331399    2.061132
   _Iyear_93 |   1.982241   .1776627    11.16   0.000     1.625214    2.339268
   _Iyear_94 |   2.129225   .1853248    11.49   0.000     1.756801    2.501649
   _Iyear_95 |   2.239698   .1884962    11.88   0.000       1.8609    2.618495
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   1.737944   .2576822     6.74   0.000     1.220112    2.255775
  _Istate_13 |  -.6716084   .4591354    -1.46   0.150    -1.594276    .2510587
  _Istate_14 |   .9409967    1.32647     0.71   0.481    -1.724645    3.606638
  _Istate_15 |   1.739859   .1288084    13.51   0.000     1.481009    1.998709
  _Istate_16 |   1.277966   .9116536     1.40   0.167     -.554071    3.110002
  _Istate_21 |   .2374292   1.877968     0.13   0.900    -3.536488    4.011347
  _Istate_22 |   .5920923   1.367751     0.43   0.667    -2.156506    3.340691
  _Istate_23 |  -.0486734   1.671465    -0.03   0.977    -3.407608    3.310261
  _Istate_31 |  -.2238145   1.574707    -0.14   0.888    -3.388307    2.940678
  _Istate_32 |  -.1477433   1.193268    -0.12   0.902    -2.545705    2.250219
  _Istate_33 |  -.2082015   1.637574    -0.13   0.899     -3.49903    3.082627
  _Istate_34 |  -.0216704   1.439343    -0.02   0.988    -2.914138    2.870798
  _Istate_35 |   .4458086   1.112169     0.40   0.690     -1.78918    2.680797
  _Istate_41 |   1.171724   1.008115     1.16   0.251    -.8541579    3.197606
  _Istate_42 |   .4221088   .7513884     0.56   0.577    -1.087863     1.93208
  _Istate_43 |   .5575696   1.091162     0.51   0.612    -1.635202    2.750341
  _Istate_44 |  -.2296412   .2927344    -0.78   0.437    -.8179131    .3586306
  _Istate_45 |  -.2549595    .313299    -0.81   0.420    -.8845574    .3746384
  _Istate_46 |   .9712572   .3941263     2.46   0.017     .1792307    1.763284
  _Istate_47 |  -.3190486   .6419182    -0.50   0.621    -1.609032    .9709344
  _Istate_51 |   2.236045   .2896634     7.72   0.000     1.653944    2.818145
  _Istate_52 |   .5644373   .9686865     0.58   0.563    -1.382211    2.511086
  _Istate_54 |   .3284672   1.092164     0.30   0.765    -1.866319    2.523254
  _Istate_55 |   .2972158   .4774604     0.62   0.537    -.6622768    1.256708
  _Istate_56 |  -.7126357   1.160802    -0.61   0.542    -3.045355    1.620084
  _Istate_57 |   -.163504   .7478797    -0.22   0.828    -1.666424    1.339416
  _Istate_58 |   .2366893   1.096938     0.22   0.830    -1.967691    2.441069
  _Istate_59 |   .3206163   1.392177     0.23   0.819    -2.477067      3.1183
  _Istate_61 |   .0933734   .7757324     0.12   0.905    -1.465519    1.652266
  _Istate_62 |  -.3715119   .9676524    -0.38   0.703    -2.316082    1.573058
  _Istate_63 |  -.6169096    .842693    -0.73   0.468    -2.310365    1.076545
  _Istate_64 |  -1.906419   .5467503    -3.49   0.001    -3.005154   -.8076827
  _Istate_71 |  -.0787295   .5127813    -0.15   0.879    -1.109202    .9517432
  _Istate_72 |   1.061458   .9754749     1.09   0.282    -.8988317    3.021749
  _Istate_73 |   .5222391   .6956585     0.75   0.456    -.8757391    1.920217
  _Istate_74 |   .0380557   1.778819     0.02   0.983    -3.536615    3.612726
  _Istate_81 |  -.9959997   .2086172    -4.77   0.000    -1.415232   -.5767678
  _Istate_82 |   .2933823   .1724506     1.70   0.095      -.05317    .6399347
  _Istate_83 |  -.0607105    .328491    -0.18   0.854    -.7208379    .5994169
  _Istate_84 |   1.305324   .8082226     1.62   0.113    -.3188596    2.929509
  _Istate_85 |   .4190551    .139583     3.00   0.004     .1385525    .6995577
  _Istate_86 |   1.053498   .6016989     1.75   0.086    -.1556609    2.262658
  _Istate_87 |   .1491419   .3347805     0.45   0.658    -.5236246    .8219084
  _Istate_88 |   .9096523   .1893899     4.80   0.000     .5290591    1.290246
  _Istate_91 |   .1703149   .8591929     0.20   0.844    -1.556298    1.896928
  _Istate_92 |   .4363405   .6763841     0.65   0.522    -.9229043    1.795585
  _Istate_93 |   .2096184   2.087018     0.10   0.920    -3.984401    4.403637
  _Istate_94 |   .3309297   .5401338     0.61   0.543    -.7545097    1.416369
  _Istate_95 |   1.299295   .1781734     7.29   0.000      .941242    1.657348
  _IstaXt_12 |  -.2010586   .0210348    -9.56   0.000    -.2433296   -.1587876
  _IstaXt_13 |   .1512057   .0420691     3.59   0.001     .0666646    .2357467
  _IstaXt_14 |  -.0898017   .0411581    -2.18   0.034     -.172512   -.0070914
  _IstaXt_15 |  -.1013524   .0146154    -6.93   0.000    -.1307231   -.0719816
  _IstaXt_16 |  -.0724691   .0475936    -1.52   0.134     -.168112    .0231738
  _IstaXt_21 |  -.1575403   .0287836    -5.47   0.000    -.2153831   -.0996976
  _IstaXt_22 |  -.1214125   .0419249    -2.90   0.006    -.2056636   -.0371613
  _IstaXt_23 |  -.0838277   .0275282    -3.05   0.004    -.1391478   -.0285077
  _IstaXt_31 |  -.0700654   .0617529    -1.13   0.262    -.1941625    .0540317
  _IstaXt_32 |   .0096652   .0397234     0.24   0.809    -.0701618    .0894923
  _IstaXt_33 |   -.080404   .0344805    -2.33   0.024    -.1496951   -.0111128
  _IstaXt_34 |   -.051188   .0294426    -1.74   0.088    -.1103552    .0079792
  _IstaXt_35 |  -.0275504   .0520458    -0.53   0.599    -.1321404    .0770396
  _IstaXt_41 |   -.167987   .0484959    -3.46   0.001    -.2654431   -.0705308
  _IstaXt_42 |  -.1417691   .0570298    -2.49   0.016    -.2563747   -.0271635
  _IstaXt_43 |  -.1480952   .0637945    -2.32   0.024     -.276295   -.0198954
  _IstaXt_44 |  -.1249695   .0526589    -2.37   0.022    -.2307914   -.0191476
  _IstaXt_45 |   .1187013   .0488284     2.43   0.019      .020577    .2168255
  _IstaXt_46 |  -.1287417   .0490019    -2.63   0.011    -.2272148   -.0302687
  _IstaXt_47 |   .0307344   .0510661     0.60   0.550    -.0718868    .1333556
  _IstaXt_51 |   -.035304   .0213326    -1.65   0.104    -.0781735    .0075656
  _IstaXt_52 |  -.0468201    .043779    -1.07   0.290    -.1347973    .0411571
  _IstaXt_54 |  -.1168183    .045578    -2.56   0.013    -.2084107   -.0252259
  _IstaXt_55 |  -.0620817   .0581386    -1.07   0.291    -.1789156    .0547521
  _IstaXt_56 |   .0697541   .0357846     1.95   0.057    -.0021577    .1416658
  _IstaXt_57 |    .029989   .0454458     0.66   0.512    -.0613377    .1213157
  _IstaXt_58 |  -.0324559   .0117058    -2.77   0.008    -.0559796   -.0089321
  _IstaXt_59 |  -.1031212   .0147815    -6.98   0.000    -.1328257   -.0734167
  _IstaXt_61 |  -.0249507   .0552703    -0.45   0.654    -.1360206    .0861192
  _IstaXt_62 |   .0582669   .0438879     1.33   0.190     -.029929    .1464629
  _IstaXt_63 |   .0405144    .036329     1.12   0.270    -.0324914    .1135202
  _IstaXt_64 |   .1855858   .0373106     4.97   0.000     .1106074    .2605642
  _IstaXt_71 |   .0076939   .0492153     0.16   0.876    -.0912079    .1065958
  _IstaXt_72 |  -.1252447   .0389658    -3.21   0.002    -.2035494     -.04694
  _IstaXt_73 |  -.0307805   .0433202    -0.71   0.481    -.1178358    .0562747
  _IstaXt_74 |  -.1621887   .0526943    -3.08   0.003     -.268082   -.0562955
  _IstaXt_81 |   .0700272   .0625773     1.12   0.269    -.0557265     .195781
  _IstaXt_82 |   -.082086   .0388826    -2.11   0.040    -.1602234   -.0039486
  _IstaXt_83 |   .0077331    .064704     0.12   0.905    -.1222945    .1377606
  _IstaXt_84 |  -.1711509   .0509594    -3.36   0.002    -.2735577   -.0687441
  _IstaXt_85 |  -.0363453   .0392544    -0.93   0.359    -.1152299    .0425394
  _IstaXt_86 |   -.040177   .0552354    -0.73   0.470    -.1511766    .0708226
  _IstaXt_87 |   .0764765   .0377291     2.03   0.048     .0006571    .1522958
  _IstaXt_88 |  -.0572837   .0550398    -1.04   0.303    -.1678904    .0533229
  _IstaXt_91 |  -.1003211   .0361507    -2.78   0.008    -.1729686   -.0276735
  _IstaXt_92 |  -.0488718   .0282336    -1.73   0.090    -.1056094    .0078658
  _IstaXt_93 |  -.1360661    .024406    -5.58   0.000    -.1851117   -.0870204
  _IstaXt_94 |   .0038846   .0518208     0.07   0.941    -.1002532    .1080224
  _IstaXt_95 |  -.0777262   .0492124    -1.58   0.121    -.1766222    .0211697
 _IstaXt2_12 |   .0086147   .0012866     6.70   0.000     .0060292    .0112001
 _IstaXt2_13 |  -.0065363   .0015026    -4.35   0.000    -.0095559   -.0035167
 _IstaXt2_14 |  -.0007848   .0020441    -0.38   0.703    -.0048925    .0033229
 _IstaXt2_15 |   .0033429   .0005228     6.39   0.000     .0022924    .0043934
 _IstaXt2_16 |   -.002597    .002152    -1.21   0.233    -.0069217    .0017276
 _IstaXt2_21 |   .0020515   .0010662     1.92   0.060    -.0000912    .0041942
 _IstaXt2_22 |   .0005371   .0018276     0.29   0.770    -.0031357    .0042098
 _IstaXt2_23 |   .0003591   .0010999     0.33   0.745    -.0018513    .0025695
 _IstaXt2_31 |   .0010896     .00317     0.34   0.733    -.0052806    .0074599
 _IstaXt2_32 |  -.0033117   .0020086    -1.65   0.106    -.0073482    .0007247
 _IstaXt2_33 |   .0021185   .0015406     1.38   0.175    -.0009774    .0052145
 _IstaXt2_34 |   .0000655   .0014039     0.05   0.963    -.0027557    .0028867
 _IstaXt2_35 |  -.0034639   .0024966    -1.39   0.172    -.0084809    .0015532
 _IstaXt2_41 |   .0036991   .0021169     1.75   0.087    -.0005549     .007953
 _IstaXt2_42 |   .0042378   .0024622     1.72   0.092    -.0007102    .0091858
 _IstaXt2_43 |   .0042141   .0031905     1.32   0.193    -.0021975    .0106257
 _IstaXt2_44 |   .0053275   .0022199     2.40   0.020     .0008665    .0097886
 _IstaXt2_45 |  -.0093494   .0025579    -3.66   0.001    -.0144897    -.004209
 _IstaXt2_46 |   .0047484   .0022237     2.14   0.038     .0002797    .0092172
 _IstaXt2_47 |  -.0021167   .0023244    -0.91   0.367    -.0067878    .0025544
 _IstaXt2_51 |  -.0029383   .0016186    -1.82   0.076    -.0061909    .0003144
 _IstaXt2_52 |   -.002612   .0019255    -1.36   0.181    -.0064815    .0012574
 _IstaXt2_54 |   .0021059   .0017868     1.18   0.244    -.0014848    .0056966
 _IstaXt2_55 |  -.0002757    .002534    -0.11   0.914     -.005368    .0048165
 _IstaXt2_56 |  -.0040002   .0013607    -2.94   0.005    -.0067347   -.0012657
 _IstaXt2_57 |  -.0016239   .0018391    -0.88   0.382    -.0053196    .0020719
 _IstaXt2_58 |  -.0011112   .0006712    -1.66   0.104    -.0024599    .0002376
 _IstaXt2_59 |   .0038815   .0005237     7.41   0.000     .0028291     .004934
 _IstaXt2_61 |  -.0008087   .0025352    -0.32   0.751    -.0059033     .004286
 _IstaXt2_62 |  -.0041661   .0019997    -2.08   0.042    -.0081847   -.0001475
 _IstaXt2_63 |  -.0021911   .0019201    -1.14   0.259    -.0060496    .0016675
 _IstaXt2_64 |  -.0049226   .0018106    -2.72   0.009    -.0085611    -.001284
 _IstaXt2_71 |    .001321   .0024436     0.54   0.591    -.0035896    .0062315
 _IstaXt2_72 |   .0026289   .0016237     1.62   0.112     -.000634    .0058917
 _IstaXt2_73 |  -.0007542   .0022996    -0.33   0.744    -.0053755     .003867
 _IstaXt2_74 |   .0060847   .0021684     2.81   0.007     .0017272    .0104423
 _IstaXt2_81 |  -.0012119   .0029359    -0.41   0.682    -.0071119    .0046881
 _IstaXt2_82 |   .0047298   .0026437     1.79   0.080    -.0005829    .0100424
 _IstaXt2_83 |   -.001173   .0030072    -0.39   0.698    -.0072163    .0048702
 _IstaXt2_84 |   .0042863   .0022215     1.93   0.059     -.000178    .0087506
 _IstaXt2_85 |   .0006771    .001789     0.38   0.707     -.002918    .0042722
 _IstaXt2_86 |  -.0015972   .0020835    -0.77   0.447    -.0057842    .0025898
 _IstaXt2_87 |  -.0038932   .0022207    -1.75   0.086    -.0083559    .0005695
 _IstaXt2_88 |   .0000298   .0028627     0.01   0.992     -.005723    .0057825
 _IstaXt2_91 |   .0019645   .0015468     1.27   0.210     -.001144     .005073
 _IstaXt2_92 |   .0007893   .0016763     0.47   0.640    -.0025793    .0041578
 _IstaXt2_93 |   .0019061   .0010655     1.79   0.080    -.0002351    .0040473
 _IstaXt2_94 |  -.0026003   .0018899    -1.38   0.175    -.0063981    .0011976
 _IstaXt2_95 |  -.0014711   .0022068    -0.67   0.508    -.0059057    .0029636
       _cons |  -16.14551   8.170365    -1.98   0.054    -32.56447    .2734503
------------------------------------------------------------------------------

. reg lnths lnemp admico_2 admico_1 admico0 admico1 admico2 admico3 mico4 admpp
> a_2 admppa_1 admppa0 admppa1 admppa2 admppa3 mppa4 admgfa_2 admgfa_1 admgfa0 
> admgfa1 admgfa2 admgfa3 mgfa4 _Iy* _Istate* _IstaXt* _IregX* if year1 , clust
> er(state);

Linear regression                                      Number of obs =     850
                                                       F( 48,    49) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.9930
                                                       Root MSE      =  .17796

                                 (Std. Err. adjusted for 50 clusters in state)
------------------------------------------------------------------------------
             |               Robust
       lnths |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnemp |   1.826087   .9102491     2.01   0.050    -.0031273    3.655301
    admico_2 |   .0391527   .0479585     0.82   0.418    -.0572234    .1355289
    admico_1 |   .0539524    .080003     0.67   0.503    -.1068196    .2147245
     admico0 |   .1575129   .0915786     1.72   0.092    -.0265212    .3415469
     admico1 |   .2041377   .1171785     1.74   0.088    -.0313412    .4396167
     admico2 |   .2964214   .1338599     2.21   0.031     .0274199     .565423
     admico3 |   .1922669   .1368264     1.41   0.166     -.082696    .4672298
       mico4 |   .2554616   .1623974     1.57   0.122    -.0708882    .5818113
    admppa_2 |  -.0042543   .0654727    -0.06   0.948    -.1358266     .127318
    admppa_1 |  -.1097817   .0868786    -1.26   0.212    -.2843707    .0648074
     admppa0 |  -.1020936      .1077    -0.95   0.348    -.3185249    .1143377
     admppa1 |  -.0592432   .1186377    -0.50   0.620    -.2976546    .1791681
     admppa2 |  -.1475344   .1193066    -1.24   0.222    -.3872899    .0922211
     admppa3 |   -.186828   .1426953    -1.31   0.197    -.4735849     .099929
       mppa4 |  -.1808085   .1460532    -1.24   0.222    -.4743134    .1126964
    admgfa_2 |  -.0514563    .084125    -0.61   0.544    -.2205117    .1175991
    admgfa_1 |  -.1027257   .1000357    -1.03   0.310    -.3037549    .0983035
     admgfa0 |  -.1415697   .1190621    -1.19   0.240     -.380834    .0976946
     admgfa1 |  -.2969872   .1498662    -1.98   0.053    -.5981546    .0041802
     admgfa2 |  -.3309195   .1791784    -1.85   0.071     -.690992     .029153
     admgfa3 |  -.3747689   .1933666    -1.94   0.058    -.7633537    .0138158
       mgfa4 |  -.3570546   .1737081    -2.06   0.045    -.7061342   -.0079751
   _Iyear_75 |  (dropped)
   _Iyear_76 |  (dropped)
   _Iyear_80 |     .17271   .2090541     0.83   0.413       -.2474      .59282
   _Iyear_81 |   .3686432   .2048065     1.80   0.078    -.0429309    .7802172
   _Iyear_82 |   .4437364   .2045826     2.17   0.035     .0326122    .8548606
   _Iyear_83 |   .3332211   .1829353     1.82   0.075    -.0344011    .7008434
   _Iyear_84 |    .681084    .161409     4.22   0.000     .3567205    1.005448
   _Iyear_85 |   1.028668   .1747511     5.89   0.000     .6774921    1.379843
   _Iyear_86 |   1.096601   .2248829     4.88   0.000     .6446822    1.548521
   _Iyear_87 |   1.216474   .2141544     5.68   0.000     .7861149    1.646834
   _Iyear_88 |   1.474756   .2841818     5.19   0.000     .9036712    2.045841
   _Iyear_89 |   1.432845   .2721587     5.26   0.000     .8859216    1.979768
   _Iyear_90 |   1.467548   .2340324     6.27   0.000     .9972419    1.937853
   _Iyear_91 |   1.557013   .2194672     7.09   0.000     1.115977    1.998048
   _Iyear_92 |   1.768077   .2434947     7.26   0.000     1.278757    2.257398
   _Iyear_93 |   2.244432   .2844695     7.89   0.000     1.672769    2.816095
   _Iyear_94 |   2.421975   .2873179     8.43   0.000     1.844588    2.999362
   _Iyear_95 |   2.456521   .3079052     7.98   0.000     1.837762    3.075279
   _Iyear_96 |  (dropped)
   _Iyear_97 |  (dropped)
  _Istate_12 |   2.171089   .2603763     8.34   0.000     1.647843    2.694334
  _Istate_13 |  -.5465738   .6618117    -0.83   0.413    -1.876534    .7833866
  _Istate_14 |   1.030629   1.755781     0.59   0.560    -2.497745    4.559002
  _Istate_15 |   1.802087   .1289665    13.97   0.000     1.542919    2.061255
  _Istate_16 |   1.267294    1.19247     1.06   0.293    -1.129063    3.663652
  _Istate_21 |   .1171868    .346489     0.34   0.737    -.5791089    .8134824
  _Istate_22 |   .6998687   .4515167     1.55   0.128    -.2074882    1.607225
  _Istate_23 |  (dropped)
  _Istate_31 |  -.3649043   .6212431    -0.59   0.560    -1.613339    .8835304
  _Istate_32 |  (dropped)
  _Istate_33 |  -.2307003   .7390028    -0.31   0.756    -1.715782    1.254381
  _Istate_34 |  -.0296573   .4051374    -0.07   0.942    -.8438114    .7844968
  _Istate_35 |   .5776426   .1557296     3.71   0.001     .2646923    .8905929
  _Istate_41 |   .6164713   .1184099     5.21   0.000     .3785178    .8544249
  _Istate_42 |  -.0415889   .4956893    -0.08   0.933    -1.037714    .9545361
  _Istate_43 |  (dropped)
  _Istate_44 |  -.5432016   1.849145    -0.29   0.770    -4.259197    3.172794
  _Istate_45 |  -.5728936   1.901778    -0.30   0.765    -4.394659    3.248872
  _Istate_46 |   .5359459   1.031387     0.52   0.606    -1.536703    2.608595
  _Istate_47 |  -.7044788   .6459661    -1.09   0.281    -2.002596    .5936385
  _Istate_51 |   2.239199   2.372407     0.94   0.350    -2.528331    7.006729
  _Istate_52 |    .388138   .6279836     0.62   0.539    -.8738423    1.650118
  _Istate_54 |    .015006   .4535543     0.03   0.974    -.8964454    .9264574
  _Istate_55 |   .2604029   1.369834     0.19   0.850    -2.492382    3.013187
  _Istate_56 |  -1.030371   .3412211    -3.02   0.004     -1.71608   -.3446615
  _Istate_57 |  -.3702216   .9624057    -0.38   0.702    -2.304248    1.563805
  _Istate_58 |  -.0303752   .4250964    -0.07   0.943    -.8846385     .823888
  _Istate_59 |  (dropped)
  _Istate_61 |   .5750228   .3076739     1.87   0.068     -.043271    1.193317
  _Istate_62 |  (dropped)
  _Istate_63 |  -.1121777   .1989395    -0.56   0.575    -.5119616    .2876062
  _Istate_64 |  -1.393499   .6380276    -2.18   0.034    -2.675663   -.1113341
  _Istate_71 |   .2117638   1.848707     0.11   0.909    -3.503352    3.926879
  _Istate_72 |   1.176999   1.142533     1.03   0.308    -1.119008    3.473005
  _Istate_73 |   .4983764   1.471375     0.34   0.736    -2.458462    3.455215
  _Istate_74 |  (dropped)
  _Istate_81 |  -1.759516   1.024463    -1.72   0.092    -3.818252    .2992198
  _Istate_82 |  -.4864441   .9353432    -0.52   0.605    -2.366087    1.393198
  _Istate_83 |  -.8235596   1.293242    -0.64   0.527    -3.422426    1.775307
  _Istate_84 |   .2782978   .2726783     1.02   0.312    -.2696696    .8262653
  _Istate_85 |  -.5254525   .6904771    -0.76   0.450    -1.913018     .862113
  _Istate_86 |  (dropped)
  _Istate_87 |  -.7248758    .484752    -1.50   0.141    -1.699021    .2492698
  _Istate_88 |   .0064815   .8139254     0.01   0.994    -1.629163    1.642126
  _Istate_91 |   .0489412   1.667293     0.03   0.977    -3.301609    3.399491
  _Istate_92 |   .4738524   1.966896     0.24   0.811    -3.478772    4.426477
  _Istate_93 |  (dropped)
  _Istate_94 |   .4326816   3.631384     0.12   0.906    -6.864858    7.730221
  _Istate_95 |   1.464782    2.87534     0.51   0.613     -4.31343    7.242993
  _IstaXt_12 |  -.2207272   .0235969    -9.35   0.000     -.268147   -.1733074
  _IstaXt_13 |   .1487354   .0361578     4.11   0.000     .0760735    .2213973
  _IstaXt_14 |  -.0833787   .0380808    -2.19   0.033    -.1599049   -.0068526
  _IstaXt_15 |  -.1058778   .0163391    -6.48   0.000    -.1387125   -.0730432
  _IstaXt_16 |  -.0422497   .0475646    -0.89   0.379    -.1378344     .053335
  _IstaXt_21 |  -.2235452   .4123368    -0.54   0.590    -1.052167    .6050765
  _IstaXt_22 |  -.1961105   .4197586    -0.47   0.642    -1.039647     .647426
  _IstaXt_23 |  -.1439361   .3958674    -0.36   0.718    -.9394614    .6515892
  _IstaXt_31 |  -.0758596   .2721613    -0.28   0.782    -.6227882     .471069
  _IstaXt_32 |  -.0343822   .2590534    -0.13   0.895    -.5549695     .486205
  _IstaXt_33 |  -.1077641   .2617293    -0.41   0.682    -.6337288    .4182007
  _IstaXt_34 |  -.0757406   .2652304    -0.29   0.776    -.6087412    .4572599
  _IstaXt_35 |  -.0689575   .2609797    -0.26   0.793    -.5934159    .4555008
  _IstaXt_41 |  -.0857935   .2575736    -0.33   0.740     -.603407      .43182
  _IstaXt_42 |  -.0601301    .244262    -0.25   0.807    -.5509929    .4307327
  _IstaXt_43 |  -.0680956   .2573717    -0.26   0.792    -.5853034    .4491123
  _IstaXt_44 |  -.0480869   .2422602    -0.20   0.843    -.5349271    .4387533
  _IstaXt_45 |   .1945232   .2431912     0.80   0.428    -.2941878    .6832341
  _IstaXt_46 |  -.0490858    .248262    -0.20   0.844    -.5479869    .4498152
  _IstaXt_47 |    .102233   .2498999     0.41   0.684    -.3999597    .6044256
  _IstaXt_51 |  -.0520403   .3656377    -0.14   0.887    -.7868167    .6827362
  _IstaXt_52 |  -.0548929   .3558317    -0.15   0.878    -.7699635    .6601777
  _IstaXt_54 |  -.1094584   .3621676    -0.30   0.764    -.8372615    .6183446
  _IstaXt_55 |  -.0698927   .2919699    -0.24   0.812    -.6566282    .5168427
  _IstaXt_56 |   .0868408   .3581705     0.24   0.809    -.6329299    .8066115
  _IstaXt_57 |   .0334376   .3523321     0.09   0.925    -.6746002    .7414754
  _IstaXt_58 |  -.0362596   .3619201    -0.10   0.921    -.7635652    .6910459
  _IstaXt_59 |  -.1087984   .3767174    -0.29   0.774    -.8658403    .6482435
  _IstaXt_61 |  -.1664407   .2029342    -0.82   0.416    -.5742524    .2413709
  _IstaXt_62 |  -.0706668   .2137526    -0.33   0.742    -.5002187    .3588852
  _IstaXt_63 |  -.1227313   .1971557    -0.62   0.536    -.5189306     .273468
  _IstaXt_64 |   .0479342   .1986196     0.24   0.810    -.3512068    .4470753
  _IstaXt_71 |  -.0230914   .3475709    -0.07   0.947    -.7215613    .6753786
  _IstaXt_72 |  -.1443917   .3336088    -0.43   0.667    -.8148036    .5260202
  _IstaXt_73 |   .0080604    .335566     0.02   0.981    -.6662847    .6824055
  _IstaXt_74 |  -.1787642   .3637268    -0.49   0.625    -.9097006    .5521721
  _IstaXt_81 |   .2552981   .1071929     2.38   0.021     .0398859    .4707104
  _IstaXt_82 |   .0633333   .1067355     0.59   0.556    -.1511596    .2778263
  _IstaXt_83 |   .1440199   .0969135     1.49   0.144     -.050735    .3387748
  _IstaXt_84 |  -.0103534   .1317934    -0.08   0.938    -.2752021    .2544953
  _IstaXt_85 |   .1372495   .1415435     0.97   0.337    -.1471928    .4216918
  _IstaXt_86 |    .140688   .1605148     0.88   0.385    -.1818786    .4632546
  _IstaXt_87 |    .216484    .125369     1.73   0.091    -.0354544    .4684224
  _IstaXt_88 |   .1067953   .1371424     0.78   0.440    -.1688026    .3823932
  _IstaXt_91 |    -.11774   .4816233    -0.24   0.808    -1.085598    .8501184
  _IstaXt_92 |  -.0827542    .449149    -0.18   0.855    -.9853528    .8198445
  _IstaXt_93 |  -.1328903   .4868399    -0.27   0.786    -1.111232     .845451
  _IstaXt_94 |   .0061361   .4920564     0.01   0.990    -.9826882    .9949604
  _IstaXt_95 |  -.1206489   .4796309    -0.25   0.802    -1.084503    .8432055
 _IstaXt2_12 |   .0094449   .0014839     6.37   0.000     .0064629    .0124268
 _IstaXt2_13 |  -.0061586   .0014193    -4.34   0.000    -.0090107   -.0033064
 _IstaXt2_14 |  -.0010471    .001962    -0.53   0.596    -.0049898    .0028956
 _IstaXt2_15 |   .0036142   .0005952     6.07   0.000     .0024181    .0048102
 _IstaXt2_16 |  -.0036309    .002023    -1.79   0.079    -.0076962    .0004345
 _IstaXt2_21 |   .0053858    .017004     0.32   0.753     -.028785    .0395567
 _IstaXt2_22 |   .0042329   .0172423     0.25   0.807    -.0304167    .0388825
 _IstaXt2_23 |    .003311   .0159463     0.21   0.836    -.0287342    .0353562
 _IstaXt2_31 |   .0009613   .0110484     0.09   0.931    -.0212413    .0231638
 _IstaXt2_32 |  -.0015563   .0101277    -0.15   0.879    -.0219087    .0187961
 _IstaXt2_33 |   .0031844   .0104198     0.31   0.761     -.017755    .0241238
 _IstaXt2_34 |   .0010258   .0104324     0.10   0.922    -.0199389    .0219904
 _IstaXt2_35 |  -.0017481   .0101001    -0.17   0.863    -.0220451    .0185489
 _IstaXt2_41 |   .0003335   .0101693     0.03   0.974    -.0201024    .0207694
 _IstaXt2_42 |   .0007548   .0098845     0.08   0.939    -.0191089    .0206184
 _IstaXt2_43 |   .0010569   .0102824     0.10   0.919    -.0196064    .0217202
 _IstaXt2_44 |     .00229   .0098112     0.23   0.816    -.0174263    .0220063
 _IstaXt2_45 |   -.012355   .0092261    -1.34   0.187    -.0308956    .0061856
 _IstaXt2_46 |   .0015628   .0098044     0.16   0.874    -.0181399    .0212654
 _IstaXt2_47 |  -.0051946   .0100944    -0.51   0.609    -.0254801    .0150908
 _IstaXt2_51 |  -.0011259   .0147311    -0.08   0.939    -.0307291    .0284774
 _IstaXt2_52 |  -.0016592   .0143978    -0.12   0.909    -.0305926    .0272742
 _IstaXt2_54 |   .0024991    .014258     0.18   0.862    -.0261535    .0311517
 _IstaXt2_55 |   .0006348   .0116783     0.05   0.957    -.0228337    .0241033
 _IstaXt2_56 |  -.0041434   .0139364    -0.30   0.767    -.0321496    .0238628
 _IstaXt2_57 |  -.0011566   .0139021    -0.08   0.934    -.0290939    .0267807
 _IstaXt2_58 |  -.0004867   .0140702    -0.03   0.973    -.0287619    .0277884
 _IstaXt2_59 |   .0045737   .0146032     0.31   0.755    -.0247725    .0339198
 _IstaXt2_61 |   .0054271   .0073773     0.74   0.465     -.009398    .0202523
 _IstaXt2_62 |   .0015185   .0077759     0.20   0.846    -.0141077    .0171448
 _IstaXt2_63 |   .0059074   .0074831     0.79   0.434    -.0091304    .0209452
 _IstaXt2_64 |   .0012908   .0072454     0.18   0.859    -.0132693    .0158509
 _IstaXt2_71 |   .0014423   .0118561     0.12   0.904    -.0223836    .0252681
 _IstaXt2_72 |   .0022356   .0119307     0.19   0.852    -.0217399    .0262112
 _IstaXt2_73 |  -.0037017    .011981    -0.31   0.759    -.0277785    .0203751
 _IstaXt2_74 |   .0056912   .0129421     0.44   0.662     -.020317    .0316994
 _IstaXt2_81 |  -.0085382   .0045124    -1.89   0.064    -.0176063    .0005298
 _IstaXt2_82 |  -.0002387   .0038704    -0.06   0.951    -.0080166    .0075392
 _IstaXt2_83 |  -.0058902   .0043589    -1.35   0.183    -.0146498    .0028693
 _IstaXt2_84 |  -.0021337   .0049376    -0.43   0.668    -.0120562    .0077889
 _IstaXt2_85 |  -.0064706   .0053429    -1.21   0.232    -.0172075    .0042663
 _IstaXt2_86 |  -.0081406   .0058405    -1.39   0.170    -.0198776    .0035964
 _IstaXt2_87 |  -.0092812   .0043765    -2.12   0.039    -.0180761   -.0004864
 _IstaXt2_88 |  -.0057056   .0043488    -1.31   0.196    -.0144449    .0030337
 _IstaXt2_91 |   .0029051   .0178702     0.16   0.872    -.0330065    .0388167
 _IstaXt2_92 |   .0023854   .0165507     0.14   0.886    -.0308744    .0356452
 _IstaXt2_93 |   .0020803   .0187964     0.11   0.912    -.0356925    .0398531
 _IstaXt2_94 |  -.0017301   .0186749    -0.09   0.927    -.0392588    .0357985
 _IstaXt2_95 |   .0006028   .0181885     0.03   0.974    -.0359483     .037154
_IregXy~2_75 |  (dropped)
_IregXy~2_76 |  (dropped)
_IregXy~2_77 |  (dropped)
_IregXy~2_78 |  (dropped)
_IregXy~2_79 |  -.0517123   1.933671    -0.03   0.979    -3.937569    3.834144
_IregXy~2_80 |  -.0655058   1.561943    -0.04   0.967    -3.204349    3.073337
_IregXy~2_81 |   -.165657   1.231336    -0.13   0.894    -2.640119    2.308805
_IregXy~2_82 |  -.0580366   .9313121    -0.06   0.951    -1.929578    1.813505
_IregXy~2_83 |   .1694954   .6618684     0.26   0.799    -1.160579     1.49957
_IregXy~2_84 |   .1515528   .4112861     0.37   0.714    -.6749575    .9780632
_IregXy~2_85 |  -.0090568   .1997502    -0.05   0.964    -.4104698    .3923562
_IregXy~2_86 |  (dropped)
_IregXy~2_87 |   .0796508   .1608895     0.50   0.623    -.2436687    .4029703
_IregXy~2_88 |   .0634374   .2672352     0.24   0.813    -.4735918    .6004667
_IregXy~2_89 |   .1690793   .3137094     0.54   0.592    -.4613434    .7995021
_IregXy~2_90 |   .1902422   .3264636     0.58   0.563    -.4658109    .8462954
_IregXy~2_91 |   .1861125   .3302178     0.56   0.576    -.4774851    .8497101
_IregXy~2_92 |   .1526116   .3035736     0.50   0.617    -.4574423    .7626656
_IregXy~2_93 |  -.0142045    .229738    -0.06   0.951    -.4758802    .4474712
_IregXy~2_94 |  -.0709303   .1344646    -0.53   0.600     -.341147    .1992865
_IregXy~2_95 |  (dropped)
_IregXy~2_96 |  (dropped)
_IregXy~2_97 |  (dropped)
_IregXy~3_75 |  (dropped)
_IregXy~3_76 |  (dropped)
_IregXy~3_77 |  (dropped)
_IregXy~3_78 |  (dropped)
_IregXy~3_79 |   .1247806   1.379936     0.09   0.928    -2.648304    2.897865
_IregXy~3_80 |  -.0488574   1.101613    -0.04   0.965    -2.262632    2.164918
_IregXy~3_81 |  -.3229415   .8831546    -0.37   0.716    -2.097707    1.451824
_IregXy~3_82 |  -.2746842   .6623421    -0.41   0.680    -1.605711    1.056342
_IregXy~3_83 |  -.0959153   .4722398    -0.20   0.840    -1.044917    .8530861
_IregXy~3_84 |  -.0007917   .2936602    -0.00   0.998    -.5909239    .5893405
_IregXy~3_85 |  -.0400916   .1578355    -0.25   0.801     -.357274    .2770908
_IregXy~3_86 |  (dropped)
_IregXy~3_87 |  -.0210978   .1292942    -0.16   0.871    -.2809242    .2387285
_IregXy~3_88 |   .0761916   .2078186     0.37   0.715    -.3414355    .4938188
_IregXy~3_89 |    .125842   .2300627     0.55   0.587    -.3364863    .5881703
_IregXy~3_90 |   .1519065   .2386649     0.64   0.527    -.3277087    .6315216
_IregXy~3_91 |   .0914524    .240239     0.38   0.705     -.391326    .5742307
_IregXy~3_92 |   .0855148   .2130853     0.40   0.690    -.3426961    .5137258
_IregXy~3_93 |  -.0974116    .159287    -0.61   0.544    -.4175107    .2226875
_IregXy~3_94 |  -.0876251   .1006609    -0.87   0.388    -.2899107    .1146606
_IregXy~3_95 |  (dropped)
_IregXy~3_96 |  (dropped)
_IregXy~3_97 |  (dropped)
_IregXy~4_75 |  (dropped)
_IregXy~4_76 |  (dropped)
_IregXy~4_77 |  (dropped)
_IregXy~4_78 |  (dropped)
_IregXy~4_79 |   .6397239   1.273645     0.50   0.618    -1.919761    3.199209
_IregXy~4_80 |   .3802176    1.02205     0.37   0.711    -1.673669    2.434105
_IregXy~4_81 |  -.1264451   .7856994    -0.16   0.873    -1.705367    1.452477
_IregXy~4_82 |  -.0822927   .5762645    -0.14   0.887     -1.24034    1.075754
_IregXy~4_83 |   .0417066   .4454698     0.09   0.926    -.8534984    .9369116
_IregXy~4_84 |   .0210648   .3000309     0.07   0.944    -.5818699    .6239996
_IregXy~4_85 |  -.0915358    .169951    -0.54   0.593    -.4330652    .2499936
_IregXy~4_86 |  (dropped)
_IregXy~4_87 |   .0178497   .2110556     0.08   0.933    -.4062825    .4419818
_IregXy~4_88 |   .0366522   .2618056     0.14   0.889    -.4894659    .5627703
_IregXy~4_89 |   .1863028   .2743623     0.68   0.500    -.3650489    .7376545
_IregXy~4_90 |   .0662869   .2938902     0.23   0.822    -.5243075    .6568813
_IregXy~4_91 |   .0559655   .3178847     0.18   0.861    -.5828477    .6947787
_IregXy~4_92 |   .0798414   .2811662     0.28   0.778    -.4851832    .6448661
_IregXy~4_93 |  -.1171156   .2168029    -0.54   0.592    -.5527973    .3185662
_IregXy~4_94 |  -.0409614    .086038    -0.48   0.636    -.2138612    .1319384
_IregXy~4_95 |  (dropped)
_IregXy~4_96 |  (dropped)
_IregXy~4_97 |  (dropped)
_IregXy~5_75 |  (dropped)
_IregXy~5_76 |  (dropped)
_IregXy~5_77 |  (dropped)
_IregXy~5_78 |  (dropped)
_IregXy~5_79 |   .2822432   1.625204     0.17   0.863    -2.983726    3.548213
_IregXy~5_80 |   .1433893   1.305354     0.11   0.913    -2.479818    2.766596
_IregXy~5_81 |    .023415   1.042775     0.02   0.982     -2.07212     2.11895
_IregXy~5_82 |   .0146174   .7735541     0.02   0.985    -1.539898    1.569133
_IregXy~5_83 |   .1374049   .5400771     0.25   0.800    -.9479207    1.222731
_IregXy~5_84 |   .1475486   .3475954     0.42   0.673    -.5509705    .8460677
_IregXy~5_85 |   .0468633   .1678602     0.28   0.781    -.2904643     .384191
_IregXy~5_86 |  (dropped)
_IregXy~5_87 |   .0363966   .1629379     0.22   0.824    -.2910395    .3638326
_IregXy~5_88 |   .0308276   .2579614     0.12   0.905    -.4875652    .5492204
_IregXy~5_89 |   .1733919   .2921812     0.59   0.556    -.4137682    .7605521
_IregXy~5_90 |   .2270141   .2812184     0.81   0.423    -.3381155    .7921438
_IregXy~5_91 |   .1304974   .2842545     0.46   0.648    -.4407334    .7017282
_IregXy~5_92 |    .136799   .2666045     0.51   0.610    -.3989628    .6725607
_IregXy~5_93 |  -.1167319    .199309    -0.59   0.561    -.5172583    .2837945
_IregXy~5_94 |  -.1374537   .1161568    -1.18   0.242    -.3708795    .0959721
_IregXy~5_95 |  (dropped)
_IregXy~5_96 |  (dropped)
_IregXy~5_97 |  (dropped)
_IregXy~6_75 |  (dropped)
_IregXy~6_76 |  (dropped)
_IregXy~6_77 |  (dropped)
_IregXy~6_78 |  (dropped)
_IregXy~6_79 |  -.2680632   1.163108    -0.23   0.819    -2.605416     2.06929
_IregXy~6_80 |  -.1847802   .9422781    -0.20   0.845    -2.078359    1.708799
_IregXy~6_81 |  -.4512574   .7819911    -0.58   0.567    -2.022727    1.120213
_IregXy~6_82 |  -.1882937   .5826162    -0.32   0.748    -1.359105    .9825174
_IregXy~6_83 |   .1504565   .4412997     0.34   0.735    -.7363685    1.037282
_IregXy~6_84 |   .1286774   .3310113     0.39   0.699    -.5365147    .7938695
_IregXy~6_85 |    .036107   .1931694     0.19   0.852    -.3520814    .4242953
_IregXy~6_86 |   .1907723   .1597926     1.19   0.238     -.130343    .5118875
_IregXy~6_87 |  (dropped)
_IregXy~6_88 |   .1604926   .1508395     1.06   0.293    -.1426308     .463616
_IregXy~6_89 |   .3051051   .1505241     2.03   0.048     .0026156    .6075945
_IregXy~6_90 |   .5512894   .1789273     3.08   0.003     .1917215    .9108573
_IregXy~6_91 |   .5467133   .2124529     2.57   0.013     .1197732    .9736533
_IregXy~6_92 |    .494923   .1492854     3.32   0.002     .1949228    .7949232
_IregXy~6_93 |   .1092722    .122616     0.89   0.377     -.137134    .3556783
_IregXy~6_94 |  -.0416364   .0812795    -0.51   0.611    -.2049737    .1217008
_IregXy~6_95 |  (dropped)
_IregXy~6_96 |  (dropped)
_IregXy~6_97 |  (dropped)
_IregXy~7_75 |  (dropped)
_IregXy~7_76 |  (dropped)
_IregXy~7_77 |  (dropped)
_IregXy~7_78 |  (dropped)
_IregXy~7_79 |   .0878005   2.095813     0.04   0.967    -4.123893    4.299494
_IregXy~7_80 |   -.188354   1.771686    -0.11   0.916    -3.748691    3.371983
_IregXy~7_81 |  -.1717061   1.536357    -0.11   0.911     -3.25913    2.915718
_IregXy~7_82 |  -.3019363   1.236891    -0.24   0.808    -2.787562     2.18369
_IregXy~7_83 |  -.0319919   .9950411    -0.03   0.974    -2.031602    1.967618
_IregXy~7_84 |  -.2345192   .7607488    -0.31   0.759    -1.763301    1.294263
_IregXy~7_85 |  -.3663383   .5438454    -0.67   0.504    -1.459237      .72656
_IregXy~7_86 |  -.2146882   .3754253    -0.57   0.570    -.9691336    .5397573
_IregXy~7_87 |  -.2752819   .2046862    -1.34   0.185    -.6866141    .1360503
_IregXy~7_88 |  (dropped)
_IregXy~7_89 |   .2629933   .1472534     1.79   0.080    -.0329235    .5589101
_IregXy~7_90 |   .3792053   .1681575     2.26   0.029     .0412801    .7171305
_IregXy~7_91 |   .5930055   .1309513     4.53   0.000      .329849     .856162
_IregXy~7_92 |   .4056555   .1705713     2.38   0.021     .0628796    .7484314
_IregXy~7_93 |   .0578365   .1476528     0.39   0.697     -.238883     .354556
_IregXy~7_94 |  -.0577653   .0930333    -0.62   0.538    -.2447227    .1291922
_IregXy~7_95 |  (dropped)
_IregXy~7_96 |  (dropped)
_IregXy~7_97 |  (dropped)
_IregXy~8_75 |  (dropped)
_IregXy~8_76 |  (dropped)
_IregXy~8_77 |  (dropped)
_IregXy~8_78 |  (dropped)
_IregXy~8_79 |   1.005527    .704252     1.43   0.160    -.4097209    2.420774
_IregXy~8_80 |   .7475386   .5828484     1.28   0.206    -.4237391    1.918816
_IregXy~8_81 |   .3650799   .5235973     0.70   0.489    -.6871284    1.417288
_IregXy~8_82 |   .1006355   .3396332     0.30   0.768     -.581883     .783154
_IregXy~8_83 |   .3152386   .3171844     0.99   0.325    -.3221674    .9526445
_IregXy~8_84 |   .2685362     .25522     1.05   0.298    -.2443476      .78142
_IregXy~8_85 |   -.131472   .2336621    -0.56   0.576    -.6010336    .3380897
_IregXy~8_86 |  -.0721892    .212544    -0.34   0.736    -.4993123     .354934
_IregXy~8_87 |  (dropped)
_IregXy~8_88 |   .0826225   .2150006     0.38   0.702    -.3494375    .5146824
_IregXy~8_89 |   .1788831   .2402012     0.74   0.460    -.3038193    .6615856
_IregXy~8_90 |    .141977   .2024394     0.70   0.486    -.2648402    .5487943
_IregXy~8_91 |   .2156397   .1042534     2.07   0.044     .0061346    .4251448
_IregXy~8_92 |   .1394629   .1208989     1.15   0.254    -.1034925    .3824182
_IregXy~8_93 |  -.0228707    .148483    -0.15   0.878    -.3212585    .2755171
_IregXy~8_94 |  -.1352816    .098697    -1.37   0.177    -.3336208    .0630575
_IregXy~8_95 |  (dropped)
_IregXy~8_96 |  (dropped)
_IregXy~8_97 |  (dropped)
_IregXy~9_75 |  (dropped)
_IregXy~9_76 |  (dropped)
_IregXy~9_77 |  (dropped)
_IregXy~9_78 |  (dropped)
_IregXy~9_79 |   .1535359   2.415694     0.06   0.950    -4.700982    5.008054
_IregXy~9_80 |  -.0519267   1.985227    -0.03   0.979    -4.041391    3.937537
_IregXy~9_81 |   .0845334   1.601788     0.05   0.958    -3.134381    3.303448
_IregXy~9_82 |  -.0849537   1.267704    -0.07   0.947    -2.632501    2.462593
_IregXy~9_83 |   .0850722   .9552486     0.09   0.929    -1.834572    2.004716
_IregXy~9_84 |   .1461215   .6681562     0.22   0.828    -1.196589    1.488832
_IregXy~9_85 |  -.1351694   .4144392    -0.33   0.746    -.9680161    .6976773
_IregXy~9_86 |   .0804596   .2077736     0.39   0.700    -.3370771    .4979964
_IregXy~9_87 |  (dropped)
_IregXy~9_88 |   .1258826   .1930748     0.65   0.517    -.2621157     .513881
_IregXy~9_89 |   .3080043   .2404538     1.28   0.206    -.1752056    .7912142
_IregXy~9_90 |   .4149396   .2705283     1.53   0.132    -.1287075    .9585866
_IregXy~9_91 |   .3248456   .2600337     1.25   0.218    -.1977116    .8474028
_IregXy~9_92 |   .1195925   .2408195     0.50   0.622    -.3643525    .6035374
_IregXy~9_93 |  -.0017612   .2115902    -0.01   0.993    -.4269676    .4234453
_IregXy~9_94 |  -.0346535   .1319664    -0.26   0.794    -.2998499    .2305429
_IregXy~9_95 |  (dropped)
_IregXy~9_96 |  (dropped)
_IregXy~9_97 |  (dropped)
       _cons |  -17.86428   11.72655    -1.52   0.134    -41.42966    5.701107
------------------------------------------------------------------------------

. 
end of do-file


. exit, clear
